tap "ardupilot/px4"
tap "aws/tap"
tap "bufbuild/buf"
tap "homebrew/bundle"
tap "homebrew/services"
tap "incu6us/tap"
tap "koekeishiya/formulae"
tap "minacle/chntpw"
tap "noahgorstein/tap"
tap "romkatv/powerlevel10k"
tap "sidneys/homebrew"
brew "act"
brew "arduino-cli"
brew "openssl@3"
brew "aria2"
brew "coreutils"
brew "asdf"
brew "python@3.12"
brew "glib"
brew "python@3.11"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "libgit2@1.7"
brew "bat"
brew "black"
brew "bottom"
brew "cabextract"
brew "cargo-c"
brew "cdrtools"
brew "cmake"
brew "cmake-docs"
brew "delve"
brew "deno"
brew "direnv"
brew "dprint"
brew "duti"
brew "node"
brew "eslint"
brew "exiftool"
brew "fd"
brew "openjpeg"
brew "opus"
brew "ffmpeg"
brew "findutils"
brew "flake8"
brew "fortune"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gcc"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "glew"
brew "glfw"
brew "glib-networking"
brew "gnu-sed"
brew "go"
brew "pkg-config"
brew "gobject-introspection"
brew "gofumpt"
brew "gomodifytags"
brew "gopass"
brew "gopls"
brew "graphviz"
brew "gtk4"
brew "pygobject3"
brew "gstreamer"
brew "hadolint"
brew "httpie"
brew "hunspell"
brew "isort"
brew "jq"
brew "kotlin"
brew "kotlin-language-server"
brew "kubernetes-cli"
brew "lazygit"
brew "lf"
brew "libvirt"
brew "libvirt-python"
brew "libxml2"
brew "livekit-cli"
brew "llvm@17"
brew "lolcat"
brew "lua"
brew "luarocks"
brew "mage"
brew "media-info"
brew "mediamtx"
brew "meson"
brew "mosquitto", restart_service: true
brew "mtr"
brew "mypy"
brew "neovim"
brew "neovide"
brew "nnn"
brew "numpy"
brew "ollama", restart_service: true
brew "open-ocd"
brew "pandoc"
brew "tree"
brew "pass"
brew "pcsc-lite"
brew "pipx"
brew "plantuml"
brew "platformio"
brew "pnpm"
brew "poppler"
brew "prettier"
brew "protobuf"
brew "python-tk@3.12"
brew "qemu"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "scrcpy"
brew "starship"
brew "stylua"
brew "syncthing", restart_service: true
brew "telnet"
brew "tidy-html5"
brew "tmux"
brew "trash"
brew "unar"
brew "universal-ctags"
brew "wabt"
brew "wget"
brew "wimlib"
brew "wireguard-tools"
brew "yazi"
brew "ykpers"
brew "yq"
brew "z.lua"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "ardupilot/px4/genromfs"
brew "bufbuild/buf/buf"
brew "minacle/chntpw/chntpw"
brew "noahgorstein/tap/jqp"
cask "android-commandlinetools"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-studio"
cask "another-redis-desktop-manager"
cask "anydesk"
cask "anythingllm"
cask "appcleaner"
cask "arduino-ide"
cask "balenaetcher"
cask "chatgpt"
cask "fbreader"
cask "figma"
cask "firefox"
cask "flutter"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcc-arm-embedded"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "gstreamer-development"
cask "gstreamer-runtime"
cask "hammerspoon"
cask "karabiner-elements"
cask "keepassxc"
cask "keka"
cask "lens"
cask "libreoffice"
cask "microsoft-edge"
cask "microsoft-remote-desktop"
cask "mitmproxy"
cask "mongodb-compass-isolated-edition"
cask "mqttx"
cask "ngrok"
cask "nrlquaker-winbox"
cask "obsidian"
cask "onyx"
cask "openvpn-connect"
cask "orbstack"
cask "pritunl"
cask "qgroundcontrol"
cask "raspberry-pi-imager"
cask "signal"
cask "sourcetree"
cask "studio-3t"
cask "teamviewer"
cask "topnotch"
cask "utm"
cask "viber"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "wezterm"
cask "whatsapp"
cask "wireshark"
cask "yubico-authenticator"
cask "yubico-yubikey-manager"
cask "zed"
cask "zed@preview"
vscode "1yib.rust-bundle"
vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "adelphes.android-dev-ext"
vscode "ahmadalli.vscode-nginx-conf"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bmalehorn.vscode-fish"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bungcip.better-toml"
vscode "christian-kohler.npm-intellisense"
vscode "clysto.plantuml"
vscode "codecov.codecov"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "developersoapbox.vscode-springboot-developer-pack"
vscode "developersoapbox.vscode-springboot-snippets"
vscode "donjayamanne.githistory"
vscode "dotenv.dotenv-vscode"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "evgeniypeshkov.syntax-highlighter"
vscode "fehey.brackets-light-pro"
vscode "fill-labs.dependi"
vscode "formulahendry.code-runner"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "foxundermoon.shell-format"
vscode "geeksharp.openssl-configuration-file"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "humao.rest-client"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "jinxdash.prettier-rust"
vscode "jithurjacob.nbpreviewer"
vscode "jscearcy.rust-doc-viewer"
vscode "kaishuu0123.vscode-erd-preview"
vscode "leizongmin.node-module-intellisense"
vscode "lorenzopirro.rust-flash-snippets"
vscode "mads-hartmann.bash-ide-vscode"
vscode "michelemelluso.gitignore"
vscode "mikkel-ol.er-syntax-highlighting"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "muuvmuuv.vscode-sundial"
vscode "naumovs.color-highlight"
vscode "nyxiative.rust-and-friends"
vscode "oderwat.indent-rainbow"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "peterj.proto"
vscode "peterschmalfeldt.explorer-exclude"
vscode "platformio.platformio-ide"
vscode "pmneo.tsimporter"
vscode "polymeilex.rust-targets"
vscode "raynigon.nginx-formatter"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rmoff.ksql"
vscode "rogalmic.bash-debug"
vscode "ronaldosena.arduino-snippets"
vscode "rpinski.shebang-snippets"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "serayuzgur.crates"
vscode "sohibe.java-generate-setters-getters"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.avro"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-ukrainian"
vscode "stringham.move-ts"
vscode "sumneko.lua"
vscode "tgriesser.avro-schemas"
vscode "timonwong.shellcheck"
vscode "tomaszbartoszewski.avro-tools"
vscode "tomblind.local-lua-debugger-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vsciot-vscode.vscode-arduino"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "william-voyek.vscode-nginx"
vscode "yinfei.luahelper"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhangyue.rust-mod-generator"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
