tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "sidneys/homebrew"
brew "coreutils"
brew "python"
brew "glib"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bottom"
brew "cargo-c"
brew "cmake"
brew "delve"
brew "direnv"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gdu"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "pkg-config"
brew "gofumpt"
brew "gomodifytags"
brew "gopls"
brew "graphviz"
brew "gstreamer"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "lolcat"
brew "lua"
brew "luarocks"
brew "mage"
brew "meson"
brew "mosquitto", restart_service: true
brew "mtr"
brew "neovim"
brew "nnn"
brew "ollama", restart_service: true
brew "tree"
brew "prettier"
brew "protobuf"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "scrcpy"
brew "starship"
brew "stylua"
brew "syncthing", restart_service: true
brew "telnet"
brew "tmux"
brew "trash"
brew "wget"
brew "wireguard-tools"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "android-file-transfer"
cask "anydesk"
cask "anythingllm"
cask "appcleaner"
cask "fbreader"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "lens"
cask "microsoft-remote-desktop"
cask "mongodb-compass-isolated-edition"
cask "mqttx"
cask "nrlquaker-winbox"
cask "obsidian"
cask "onyx"
cask "openvpn-connect"
cask "pritunl"
cask "raspberry-pi-imager"
cask "signal"
cask "topnotch"
cask "viber"
cask "visual-studio-code"
cask "vmware-fusion"
cask "wezterm"
cask "whatsapp"
cask "zed"
